from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = Template(
    "\n".join(
        [
            "أنت مساعد لتوليد رد للمستخدم.",
            "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
            "يجب أن تقوم بتوليد الرد بناءً على المستندات المقدمة.",
            "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
            "يمكنك أن تعتذر للمستخدم إذا لم تتمكن من توليد رد.",
            "يجب أن يكون الرد بنفس لغة استفسار المستخدم.",
            "كن مهذبًا ومحترمًا مع المستخدم.",
            "كن دقيقًا ومختصرًا في ردك.",
        ]
    )
)

#### Document ####
document_prompt = Template(
    "\n".join(
        [
            "## المستند رقم: $doc_num",
            "### المحتوى: $chunk_text",
        ]
    )
)


#### Footer ####
footer_prompt = Template(
    "\n".join(
        [
            "بناءً فقط على المستندات أعلاه، يرجى توليد إجابة للمستخدم",
            "## السؤال:",
            "$query",
            "## الإجابة:",
        ]
    )
)
